turbulenceMMAOpt/app_iso_brinkman_plus_turbDT_20260323/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 0.01;

xMin 0;
xMax 0.5;
yMin 0;
yMax 1;
zMin -0.003;
zMax 0;
xD 0.4;
yDMin -0.2;
yDMax 1.2;

fNx 40;
fNy 80;
Ny 400;
Nx 160;

vertices
(
    ($xMin $yMin $zMin)
    ($xMax $yMin $zMin)
    ($xMax $yMax $zMin)
    ($xMin $yMax $zMin)
    ($xMax $yDMax $zMin)
    ($xD $yDMax $zMin)
    ($xD $yMax $zMin)
    ($xD $yMin $zMin)
    ($xD $yDMin $zMin)
    ($xMax $yDMin $zMin)

    ($xMin $yMin $zMax)
    ($xMax $yMin $zMax)
    ($xMax $yMax $zMax)
    ($xMin $yMax $zMax)
    ($xMax $yDMax $zMax)
    ($xD $yDMax $zMax)
    ($xD $yMax $zMax)
    ($xD $yMin $zMax)
    ($xD $yDMin $zMax)
    ($xMax $yDMin $zMax)
);

blocks
(
    hex (0 7 6 3 10 17 16 13)
    test_area
    ($Nx $Ny 1)
    simpleGrading (1 1 1)

    hex (7 1 2 6 17 11 12 16)
    test_area
    ($fNx $Ny 1)
    simpleGrading (1 1 1)

    hex (6 2 4 5 16 12 14 15)
    fluid_area
    ($fNx $fNy 1)
    simpleGrading (1 1 1)

    hex (1 7 8 9 11 17 18 19)
    fluid_area
    ($fNx $fNy 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (4 5 15 14)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (19 18 8 9)
        );
    }
    Wall
    {
        type wall;
        faces
        (
            (0 10 13 3)
            (0 7 17 10)
            (7 8 18 17)
            (5 6 16 15)
            (6 3 13 16)
        );
    }
    right
    {
        type symmetry;
        faces
        (
            (1 2 12 11)
            (2 4 14 12)
            (9 1 11 19)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 6 7)
            (6 2 1 7)
            (9 8 7 1)
            (6 5 4 2)
            (10 17 16 13)
            (17 11 12 16)
            (11 17 18 19)
            (12 14 15 16)
        );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //
